import UIKit

// В своем файле Playground:
// 1. Проинициализируйте константу типа Int с каким-либо значением
let const1: Int = 100

// 2. Проинициализируйте переменную типа Int с каким-либо значением
var var1: Int = 200

// 3. Проинициализируйте переменную типа Int со значением, равным сумме ранее созданной константе и переменной
var sum: Int = const1 + var1

// 4. Задайте новое значение переменной, созданной в п.3, равное произведению константы из п.1 и переменной из п.2
sum = const1 * var1

// 5. Проинициализируйте переменую типа Double с каким-либо значением
var pi: Double = 3.14


// 6. Проинициализируйте переменную типа Bool с рузьтатом сравнения константы из п.1 и переменной из п.2
var bool: Bool = const1 == var1


// 7. Проинициализируйте переменую типа String с каким-либо значением
var str: String = "Проинициализируйте переменую типа String"

